Revit 2027 API
STLImportOptions(STLImportOptions) Constructor
 Constructs a new instance of STLImportOptions as a copy of the import options.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public STLImportOptions(
	STLImportOptions option
)
Public Sub New (
	option As STLImportOptions
)
public:
STLImportOptions(
	STLImportOptions^ option
)
new :
        option : STLImportOptions -> STLImportOptions
Parameters
option STLImportOptions
 The STL options to be copied.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
STLImportOptions Class
STLImportOptions Overload
Autodesk.Revit.DB Namespace